<template>
  <div id="home">
    <section>
      <h1 class="text-xl font-bold">咖啡起源</h1>
      <img src="../assets/source.jpeg" alt="coffee's source" width="60%" />
      <p class="leading-16">
        古代中国有神农氏尝百草，并一一加以记录整理，使后人对许多植物能有系统的认识。西方世界没有神农氏这样的人，更没有留下什么有文字的记录，因此关于咖啡的起源有种种不同的传说。其中，最普遍且为大众所乐道的是牧羊人的故事。
        古时候的阿拉伯人最早把咖啡豆晒干熬煮后，把汁液当作胃药来喝，认为可以有助消化。后来发现咖啡还有提神醒脑的作用，同时由于回教严禁教徒饮酒，因而就用咖啡取代酒精饮料，作为提神的饮料而时常饮用。十五世纪以后，到圣地麦加朝圣的回教徒陆续将咖啡带回居住地，使咖啡渐渐流传到埃及、叙利亚、伊朗和土尔其等国。咖啡进入欧陆当归因于土耳其当时的鄂图曼帝国，由于嗜饮咖啡的鄂图曼大军西征欧陆且在当地驻扎数年之久，在大军最后撤离时，留下了包括咖啡豆在内的大批补给品，维也纳和巴黎的人们得以凭着这些咖啡豆，和由土耳其人那里得到的烹制经验，而发展出欧洲的咖啡文化。战争原是攻占和毁灭，却意外地带来了文化的交流乃至融合，这可是统治者们所始料未及的了。
        西方人都熟知咖啡有三百年的历史，然而在东方，咖啡在更久远前的年代已作为一种饮料在社会各阶层普及。咖啡出现的最早且最确切的时间是公元前8世纪，但是早在荷马的作品（希腊诗人，生卒年有争论，一较权威说法是生于公元前744年---译者注）和许多古老的阿拉伯传奇里，就已记述了一种神奇的，色黑，味苦涩，且具有强烈刺激力量的饮料。公元10世纪前后，阿维森纳（Avicenna,980-1037，古代伊斯兰世界最杰出的集大成者之一，是哲学家，医生，理论家等---译者注）在用咖啡当作药物治疗疾病。还有一个源自15世纪的奇特故事，传说一个也门牧羊人看见一群山羊从一丛灌木上衔落色泽微红的浆果，很快这些山羊变得焦躁不安，兴奋不已，这个牧羊人把这件事报告给了一位修道士（在中东和西方古时修道士是掌握知识的上层阶级---译者注），
        这位修道士将一些浆果煮熟，然后提炼出一种味苦，劲足的，能驱赶困倦和睡意的饮料。
      </p>

      <p>
        虽然咖啡是在中东被发现，但是咖啡树最早源于非洲一个现属埃塞俄比亚的地区，叫Kaffa，
        从这里咖啡传向也门，阿拉伯半岛和埃及，正是在埃及，咖啡的发展异常迅猛，并很快流行进入人们的日常生活。到16世纪时，早期的商人已在欧洲贩卖咖啡，由此将咖啡作为一种新型饮料引进西方的风俗和生活。绝大部分出口到欧洲市场的咖啡来自亚历山大港和士麦那（土耳其西部港市---译者注），但是随着市场需求的日益增长，进出口港口强加的高额关税，以及人们对咖啡树种植领域知识的增强，使得经销商和科学家开始试验把咖啡移植到其他国家。荷兰人在他们的海外殖民地（巴达维亚和爪哇，〈巴达维亚即现印尼首都雅加达的旧称---译者注〉），法国人1723年在马提尼克岛（位于拉丁美洲），以及随后又在安的列斯群岛（位于西印度群岛---译者注）都移植了咖啡树；后来英国人，西班牙人和葡萄牙人开始侵占亚洲和美洲热带咖啡种植区。
        1727年巴西北部开始了咖啡种植，然而糟糕的气候条件使得这种作物种植逐渐转移到了其他区域，最初是里约热内卢，最后到了圣保罗和米纳斯洲（大约1800-1850期间），在这里咖啡找到了它最理想的生长环境。咖啡种植在这里发展壮大，直到成为巴西最重要的经济来源。正是在1740到1850期间咖啡种植在中南美洲达到了它的普及之最。虽然咖啡诞生于非洲，但是种植和家庭消费却相对来说是近代才引进的。实际上，正是欧洲人让咖啡重返故地，将其引进他们的殖民地，在那里，由于有利的土地和气候条件，咖啡才得以兴旺繁荣。
      </p>
    </section>
  </div>
</template>

<script>
export default {
  name: "Home",
};
</script>

<style lang="scss">
#home {
  background-color: var(--bgColor);
  height: 100%;
}
section {
  p {
    margin-top: 10px;
    font-size: 1.1rem;
    text-indent: 2em;
    line-height: 2em;
    // width: 40%;
  }
  h1 {
    color: var(--primary);
  }
  img {
    float: right;
    border-radius: 20px;
  }
  padding: 3%;
}
</style>
